spring-boot/.results/latency-graalvm.txt
Running 3m test @ http://localhost:8103/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 6.808ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.730ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.762ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.778ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.724ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.68ms    3.73ms  61.95ms   92.91%
    Req/Sec   205.37     43.47   529.00     85.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.78ms
 75.000%    6.58ms
 90.000%    8.81ms
 99.000%   24.70ms
 99.900%   42.56ms
 99.990%   52.80ms
 99.999%   61.15ms
100.000%   61.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.617     0.000000            1         1.00
       4.743     0.100000        17052         1.11
       5.067     0.200000        34211         1.25
       5.315     0.300000        50985         1.43
       5.547     0.400000        68087         1.67
       5.779     0.500000        85157         2.00
       5.903     0.550000        93583         2.22
       6.039     0.600000       102102         2.50
       6.187     0.650000       110462         2.86
       6.367     0.700000       119108         3.33
       6.583     0.750000       127481         4.00
       6.715     0.775000       131695         4.44
       6.883     0.800000       135935         5.00
       7.099     0.825000       140228         5.71
       7.407     0.850000       144459         6.67
       7.899     0.875000       148660         8.00
       8.303     0.887500       150806         8.89
       8.815     0.900000       152922        10.00
       9.423     0.912500       155038        11.43
      10.151     0.925000       157159        13.33
      11.047     0.937500       159288        16.00
      11.567     0.943750       160347        17.78
      12.199     0.950000       161406        20.00
      12.943     0.956250       162472        22.86
      13.855     0.962500       163526        26.67
      14.967     0.968750       164588        32.00
      15.631     0.971875       165127        35.56
      16.415     0.975000       165651        40.00
      17.423     0.978125       166186        45.71
      18.607     0.981250       166718        53.33
      20.239     0.984375       167245        64.00
      21.247     0.985938       167511        71.11
      22.399     0.987500       167774        80.00
      23.727     0.989062       168040        91.43
      25.455     0.990625       168305       106.67
      27.839     0.992188       168570       128.00
      29.263     0.992969       168703       142.22
      31.055     0.993750       168836       160.00
      32.495     0.994531       168968       182.86
      33.823     0.995313       169101       213.33
      34.943     0.996094       169234       256.00
      35.519     0.996484       169302       284.44
      36.287     0.996875       169368       320.00
      36.959     0.997266       169438       365.71
      37.567     0.997656       169499       426.67
      38.527     0.998047       169566       512.00
      39.199     0.998242       169599       568.89
      39.967     0.998437       169633       640.00
      40.927     0.998633       169666       731.43
      41.759     0.998828       169698       853.33
      42.815     0.999023       169733      1024.00
      43.519     0.999121       169749      1137.78
      44.255     0.999219       169765      1280.00
      44.799     0.999316       169781      1462.86
      45.695     0.999414       169798      1706.67
      46.591     0.999512       169815      2048.00
      47.039     0.999561       169823      2275.56
      47.551     0.999609       169831      2560.00
      48.063     0.999658       169839      2925.71
      48.703     0.999707       169848      3413.33
      49.151     0.999756       169857      4096.00
      49.311     0.999780       169860      4551.11
      49.727     0.999805       169864      5120.00
      49.951     0.999829       169868      5851.43
      50.751     0.999854       169873      6826.67
      51.615     0.999878       169877      8192.00
      52.159     0.999890       169879      9102.22
      52.863     0.999902       169881     10240.00
      53.471     0.999915       169883     11702.86
      53.791     0.999927       169885     13653.33
      54.431     0.999939       169887     16384.00
      55.423     0.999945       169888     18204.44
      55.519     0.999951       169889     20480.00
      56.671     0.999957       169890     23405.71
      56.799     0.999963       169891     27306.67
      57.183     0.999969       169892     32768.00
      57.983     0.999973       169893     36408.89
      57.983     0.999976       169893     40960.00
      59.551     0.999979       169894     46811.43
      59.551     0.999982       169894     54613.33
      61.151     0.999985       169895     65536.00
      61.151     0.999986       169895     72817.78
      61.151     0.999988       169895     81920.00
      61.535     0.999989       169896     93622.86
      61.535     0.999991       169896    109226.67
      61.535     0.999992       169896    131072.00
      61.535     0.999993       169896    145635.56
      61.535     0.999994       169896    163840.00
      61.983     0.999995       169897    187245.71
      61.983     1.000000       169897          inf
#[Mean    =        6.680, StdDeviation   =        3.734]
#[Max     =       61.952, Total count    =       169897]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  180000 requests in 3.00m, 64.23MB read
Requests/sec:    999.99
Transfer/sec:    365.42KB