spring-boot/.results/latency-jvm.txt
Running 3m test @ http://localhost:8103/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 7.069ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 7.072ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 7.059ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 7.070ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 7.102ms, rate sampling interval: 22ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.50ms    3.59ms 167.17ms   92.47%
    Req/Sec   204.16     39.17   476.00     84.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.64ms
 75.000%    6.53ms
 90.000%    8.70ms
 99.000%   18.96ms
 99.900%   46.78ms
 99.990%   85.44ms
 99.999%  117.38ms
100.000%  167.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.427     0.000000            1         1.00
       4.607     0.100000        17128         1.11
       4.927     0.200000        34133         1.25
       5.179     0.300000        51118         1.43
       5.407     0.400000        68102         1.67
       5.643     0.500000        84978         2.00
       5.775     0.550000        93517         2.22
       5.919     0.600000       101997         2.50
       6.087     0.650000       110620         2.86
       6.283     0.700000       119031         3.33
       6.531     0.750000       127468         4.00
       6.687     0.775000       131747         4.44
       6.875     0.800000       135969         5.00
       7.123     0.825000       140201         5.71
       7.447     0.850000       144447         6.67
       7.927     0.875000       148672         8.00
       8.255     0.887500       150816         8.89
       8.703     0.900000       152932        10.00
       9.319     0.912500       155060        11.43
      10.119     0.925000       157180        13.33
      11.143     0.937500       159300        16.00
      11.743     0.943750       160354        17.78
      12.391     0.950000       161423        20.00
      13.055     0.956250       162477        22.86
      13.759     0.962500       163552        26.67
      14.567     0.968750       164601        32.00
      14.959     0.971875       165135        35.56
      15.439     0.975000       165671        40.00
      15.959     0.978125       166210        45.71
      16.511     0.981250       166736        53.33
      17.167     0.984375       167262        64.00
      17.503     0.985938       167523        71.11
      17.983     0.987500       167787        80.00
      18.527     0.989062       168052        91.43
      19.519     0.990625       168321       106.67
      20.815     0.992188       168583       128.00
      21.695     0.992969       168717       142.22
      22.607     0.993750       168851       160.00
      23.967     0.994531       168981       182.86
      25.471     0.995313       169114       213.33
      27.423     0.996094       169247       256.00
      28.687     0.996484       169313       284.44
      30.143     0.996875       169381       320.00
      31.567     0.997266       169446       365.71
      33.791     0.997656       169512       426.67
      36.511     0.998047       169579       512.00
      38.015     0.998242       169612       568.89
      39.839     0.998437       169645       640.00
      41.631     0.998633       169678       731.43
      43.839     0.998828       169711       853.33
      47.231     0.999023       169745      1024.00
      48.639     0.999121       169761      1137.78
      51.391     0.999219       169779      1280.00
      55.455     0.999316       169794      1462.86
      58.719     0.999414       169811      1706.67
      61.183     0.999512       169829      2048.00
      63.871     0.999561       169836      2275.56
      65.599     0.999609       169844      2560.00
      66.239     0.999658       169852      2925.71
      67.071     0.999707       169861      3413.33
      71.103     0.999756       169869      4096.00
      72.575     0.999780       169873      4551.11
      73.343     0.999805       169877      5120.00
      74.815     0.999829       169881      5851.43
      77.055     0.999854       169886      6826.67
      82.239     0.999878       169890      8192.00
      82.559     0.999890       169892      9102.22
      87.615     0.999902       169894     10240.00
      90.559     0.999915       169896     11702.86
     105.023     0.999927       169898     13653.33
     111.423     0.999939       169900     16384.00
     112.959     0.999945       169901     18204.44
     113.023     0.999951       169902     20480.00
     115.455     0.999957       169903     23405.71
     116.095     0.999963       169905     27306.67
     116.095     0.999969       169905     32768.00
     116.607     0.999973       169906     36408.89
     116.607     0.999976       169906     40960.00
     116.735     0.999979       169907     46811.43
     116.735     0.999982       169907     54613.33
     117.375     0.999985       169908     65536.00
     117.375     0.999986       169908     72817.78
     117.375     0.999988       169908     81920.00
     120.959     0.999989       169909     93622.86
     120.959     0.999991       169909    109226.67
     120.959     0.999992       169909    131072.00
     120.959     0.999993       169909    145635.56
     120.959     0.999994       169909    163840.00
     167.295     0.999995       169910    187245.71
     167.295     1.000000       169910          inf
#[Mean    =        6.502, StdDeviation   =        3.593]
#[Max     =      167.168, Total count    =       169910]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  180000 requests in 3.00m, 64.23MB read
Requests/sec:    999.98
Transfer/sec:    365.41KB